app/views/posts/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "comments" ON "users"."id" = "comments"."user_id" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---

  <% @post.users.each do |user| %>